---
kind: other
id: Properties.T:Autodesk.Revit.DB.SketchBase
source: html/a2f4336b-62d5-fc3a-9385-d0bf5be790a6.htm
---
# SketchBase Properties

The id of the assembly instance to which the element belongs.